Repository: Navoto01/anonai-bu
Catalog: lib/l10n/app_*.arb
Languages: hu, iw, ro

# grammarCheckInputHint
source: Enter text to check grammar...
hu: Írd be a szöveget, amit ellenőrizni szeretnél...
iw: הזן טקסט לבדוק דקדוק...
ro: Introduceți textul pentru verificarea gramaticii...

# writingStyleInputHint
source: Enter text to rewrite in selected style...
hu: Írd be a szöveget, amit át szeretnél írni a kiválasztott stílusban...
iw: הזן טקסט לשכתוב בסגנון שנבחר...
ro: Introduceți textul de rescris în stilul selectat...

# messageHint
source: Type a message...
hu: Írj üzenetet...
iw: הקלד הודעה...
ro: Scrie un mesaj...

# aiTyping
source: AI is typing...
hu: AI gépel...
iw: ה-AI מקליד...
ro: AI scrie...

# networkError
source: Network error: {error}
hu: Hálózati hiba: {error}
iw: שגיאת רשת: {error}
ro: Eroare de rețea: {error}

# apiError
source: Error: {error}
hu: Hiba: {error}
iw: שגיאה: {error}
ro: Eroare: {error}

# jsonParseError
source: JSON parse error: {error}
hu: JSON parse hiba: {error}
iw: שגיאת ניתוח JSON: {error}
ro: Eroare de parsare JSON: {error}

source: Settings
hu: Beállítások
iw: הגדרות
ro: Setări

source: Appearance
hu: Megjelenés
iw: מראה
ro: Aspect

source: Dark Mode
hu: Sötét mód
iw: מצב כהה
ro: Mod întunecat

# darkModeDesc
source: Use dark theme throughout the app
hu: Sötét téma használata az alkalmazásban
iw: השתמש בערכת נושא כהה בכל האפליקציה
ro: Folosește tema întunecată în toată aplicația

# fontSize
source: Conversation Settings
hu: Beszélgetés beállítások
iw: הגדרות שיחה
ro: Setări conversație

# fontSizeDesc
source: Customize how messages appear in conversations
hu: Testreszabás, hogyan jelennek meg az üzenetek a beszélgetésekben
iw: התאם אישית כיצד הודעות מוצגות בשיחות
ro: Personalizează cum apar mesajele în conversații

# fontSizeLabel
source: Font Size
hu: Betűméret
iw: גודל גופן
ro: Mărimea fontului

source: Language
hu: Nyelv
iw: שפה
ro: Limba

# languageDesc
source: Choose your preferred language
hu: Válaszd ki a preferált nyelvet
iw: בחר את השפה המועדפת עליך
ro: Alege limba preferată

source: Select Language
hu: Nyelv kiválasztása
iw: בחר שפה
ro: Selectează limba

source: Experience
hu: Élmény
iw: חווייה
ro: Experiență

source: Animations
hu: Animációk
iw: אנימציות
ro: Animații

# animationsDesc
source: Enable smooth animations and transitions
hu: Sima animációk és átmenetek engedélyezése
iw: אפשר אנימציות ומעברים חלקים
ro: Activează animații și tranziții fluide

source: Sound Effects
hu: Hangeffektek
iw: אפקטים קוליים
ro: Efecte sonore

# soundEffectsDesc
source: Play sounds for interactions
hu: Hangok lejátszása az interakciókhoz
iw: נגן צלילים לאינטראקציות
ro: Redă sunete pentru interacțiuni

source: About
hu: Névjegy
iw: אודות
ro: Despre

source: Version
hu: Verzió
iw: גרסה
ro: Versiunea

source: Credits
hu: Készítők
iw: קרדיטים
ro: Credite

# creditsDesc
source: View app credits and acknowledgments
hu: Alkalmazás készítők és köszönetnyilvánítások megtekintése
iw: הצג קרדיטים והוקרות לאפליקציה
ro: Vezi creditele aplicației și mulțumiri

source: Privacy Policy
hu: Adatvédelmi szabályzat
iw: מדיניות פרטיות
ro: Politica de confidențialitate

# privacyPolicyDesc
source: Read our privacy policy
hu: Adatvédelmi szabályzat elolvasása
iw: קרא את מדיניות הפרטיות שלנו
ro: Citește politica noastră de confidențialitate

source: Close
hu: Bezárás
iw: סגור
ro: Închide

# createdBy
source: Created by Navoto01 & AnonLab
hu: Készítette: Navoto01 & AnonLab
iw: נוצר על ידי Navoto01 & AnonLab
ro: Creat de Navoto01 & AnonLab

# motto
source: Making a better future
hu: Jobb jövőt teremtünk
iw: יוצרים עתיד טוב יותר
ro: Creând un viitor mai bun

source: Buy AnonLab Pro
hu: AnonLab Pro vásárlása
iw: קנה AnonLab Pro
ro: Cumpără AnonLab Pro

# proActive
source: Active
hu: Aktív
iw: פעיל
ro: Activ

source: Pro Contains:
hu: Pro tartalmazza:
iw: Pro כולל:
ro: Pro conține:

source: Pro Features Unlocked:
hu: Pro funkciók feloldva:
iw: תכונות Pro נפתחו:
ro: Funcții Pro deblocate:

source: AnonAI Pro Model
hu: AnonAI Pro modell
iw: מודל AnonAI Pro
ro: Modelul AnonAI Pro

source: More Soon
hu: Hamarosan több
iw: עוד בקרוב
ro: Mai multe în curând

source: Buy Now
hu: Vásárlás most
iw: קנה עכשיו
ro: Cumpără acum

source: Promo Code
hu: Promóciós kód
iw: קוד קידום
ro: Cod promoțional

source: Purchase AnonLab Pro
hu: AnonLab Pro vásárlása
iw: רכוש AnonLab Pro
ro: Cumpără AnonLab Pro

# purchaseDemo
source: This is a demo app. In a real app, this would integrate with your app store's payment system.
hu: Ez egy demo alkalmazás. Egy valódi alkalmazásban ez integrálódna az app store fizetési rendszerével.
iw: זוהי אפליקציית הדגמה. באפליקציה אמיתית זה ישולב עם מערכת התשלומים של חנות האפליקציות שלך.
ro: Aceasta este o aplicație demo. Într-o aplicație reală, aceasta s-ar integra cu sistemul de plăți al magazinului de aplicații.

source: Cancel
hu: Mégse
iw: ביטול
ro: Anulează

# continueButton
source: Continue
hu: Folytatás
iw: המשך
ro: Continuă

# enterPromoCode
source: Enter your promotion key code:
hu: Add meg a promóciós kulcskódot:
iw: הזן את קוד הקידום שלך:
ro: Introdu codul cheie promoțional:

# promoCodeHint
source: Enter promo code...
hu: Promóciós kód megadása...
iw: הזן קוד קידום...
ro: Introdu codul promoțional...

source: Submit
hu: Küldés
iw: שלח
ro: Trimite

# invalidPromoCode
source: Invalid promo code. Please try again.
hu: Érvénytelen promóciós kód. Kérlek próbáld újra.
iw: קוד קידום לא חוקי. נסה שוב.
ro: Cod promoțional invalid. Te rugăm să încerci din nou.

source: Welcome to Pro!
hu: Üdvözöl a Pro!
iw: ברוך הבא ל-Pro!
ro: Bun venit la Pro!

# proActivatedSuccess
source: AnonLab Pro has been activated successfully
hu: Az AnonLab Pro sikeresen aktiválva lett
iw: AnonLab Pro הופעל בהצלחה
ro: AnonLab Pro a fost activat cu succes

source: Account
hu: Fiók
iw: חשבון
ro: Cont

source: Logged in user
hu: Bejelentkezett felhasználó
iw: משתמש מחובר
ro: Utilizator conectat

source: Log Out
hu: Kijelentkezés
iw: התנתק
ro: Deconectare

# loginTitle
source: Welcome Back
hu: Üdvözlünk vissza
iw: ברוך שובך
ro: Bun venit înapoi

# loginSubtitle
source: Sign in with AnonID
hu: Bejelentkezés AnonID-val
iw: התחבר עם AnonID
ro: Conectează-te cu AnonID

source: How to login
hu: Hogyan jelentkezz be
iw: איך להתחבר
ro: Cum să te conectezi

# loginGuideTitle
source: How to Login or Register
hu: Bejelentkezés vagy Regisztráció
iw: איך להתחבר או להירשם
ro: Cum să te conectezi sau să te înregistrezi

# loginGuideText
source: To access AnonAI with your account, follow these simple steps: 1. **Visit the Registration Website** Go to anon.smstar.hu in your web browser 2. **Create Your Account** • Register a new account with your preferred details • Or login if you already have an account • Use your AnonID, username, or email • Set a secure password 3. **Return to AnonAI** Come back to this app and enter your login details: • AnonID, username, or email • Your password 4. **Important Security Notice** ⚠️ **DON'T LOSE YOUR ACCOUNT!** Your account credentials are very important. Make sure to: • Remember your login details • Keep your password secure • Write down your AnonID if needed 5. **Start Using AnonAI** Once logged in, you'll have access to all AnonAI features and your data will be synced across devices. Need help? Visit anon.smstar.hu for more support.
hu: Az AnonAI fiókkal való használatához kövesd ezeket az egyszerű lépéseket: 1. **Látogasd meg a regisztrációs weboldalt** Menj az anon.smstar.hu oldalra a böngésződben 2. **Hozd létre a fiókodat** • Regisztrálj egy új fiókot a preferált adataiddal • Vagy jelentkezz be, ha már van fiókod • Használd az AnonID-d, felhasználóneved vagy e-mail címed • Állíts be egy biztonságos jelszót 3. **Térj vissza az AnonAI-hoz** Gyere vissza ehhez az alkalmazáshoz és add meg a bejelentkezési adataidat: • AnonID, felhasználónév vagy e-mail • A jelszavad 4. **Fontos biztonsági figyelmeztetés** ⚠️ **NE VESZÍTSD EL A FIÓKODAT!** A fiók adataid nagyon fontosak. Győződj meg róla, hogy: • Emlékszel a bejelentkezési adataidra • Biztonságban tartod a jelszavad • Szükség esetén felírod az AnonID-d 5. **Kezdd el használni az AnonAI-t** Bejelentkezés után hozzáférsz az összes AnonAI funkcióhoz és az adataid szinkronizálva lesznek az eszközök között. Segítségre van szükséged? Látogasd meg az anon.smstar.hu oldalt további támogatásért.
iw: 要使用您的账户访问 AnonAI，请按照以下简单步骤操作： 1. **访问注册网站** 在您的网络浏览器中访问 anon.smstar.hu 2. **创建您的账户** • 使用您的首选详细信息注册新账户 • 或者如果您已有账户则登录 • 使用您的 AnonID、用户名或电子邮件 • 设置安全密码 3. **返回 AnonAI** 回到此应用程序并输入您的登录详细信息： • AnonID、用户名或电子邮件 • 您的密码 4. **重要安全提醒** ⚠️ **不要丢失您的账户！** 您的账户凭据非常重要。请确保： • 记住您的登录详细信息 • 保持密码安全 • 如需要请记下您的 AnonID 5. **开始使用 AnonAI** 登录后，您将可以访问所有 AnonAI 功能，您的数据将在设备间同步。 需要帮助？请访问 anon.smstar.hu 获取更多支持。
ro: Pentru a accesa AnonAI cu contul tău, urmează acești pași simpli: 1. **Vizitează site-ul de înregistrare** Mergi la anon.smstar.hu în browserul tău web 2. **Creează-ți contul** • Înregistrează un cont nou cu detaliile preferate • Sau conectează-te dacă ai deja un cont • Folosește AnonID-ul, numele de utilizator sau email-ul • Setează o parolă sigură 3. **Întoarce-te la AnonAI** Revino la această aplicație și introdu detaliile de conectare: • AnonID, numele de utilizator sau email • Parola ta 4. **Notificare importantă de securitate** ⚠️ **NU-ȚI PIERDE CONTUL!** Credențialele contului tău sunt foarte importante. Asigură-te că: • Îți amintești detaliile de conectare • Păstrezi parola în siguranță • Notezi AnonID-ul dacă este necesar 5. **Începe să folosești AnonAI** Odată conectat, vei avea acces la toate funcțiile AnonAI și datele tale vor fi sincronizate pe toate dispozitivele. Ai nevoie de ajutor? Vizitează anon.smstar.hu pentru mai mult suport.

# userIdHint
source: Enter your AnonID
hu: Add meg az AnonID-d
iw: הזן את ה-AnonID שלך
ro: Introdu AnonID-ul tău

# passwordLabel
source: Password
hu: Jelszó
iw: סיסמה
ro: Parola

# passwordHint
source: Enter your password
hu: Add meg a jelszavad
iw: הזן את הסיסמה שלך
ro: Introdu parola ta

# loginButton
source: Sign In
hu: Bejelentkezés
iw: התחבר
ro: Conectare

# loginError
source: Login failed: {error}
hu: Bejelentkezés sikertelen: {error}
iw: ההתחברות נכשלה: {error}
ro: Conectarea a eșuat: {error}

# allFieldsRequired
source: All fields are required
hu: Minden mező kitöltése kötelező
iw: כל השדות נדרשים
ro: Toate câmpurile sunt obligatorii

# invalidCredentials
source: Invalid AnonID or password
hu: Érvénytelen AnonID vagy jelszó
iw: AnonID או סיסמה לא חוקיים
ro: AnonID sau parolă invalidă

source: User not found
hu: Felhasználó nem található
iw: המשתמש לא נמצא
ro: Utilizatorul nu a fost găsit

# skipLogin
source: Skip for now
hu: Kihagyás egyelőre
iw: דלג לעת עתה
ro: Sari pentru moment

source: Speed
hu: Sebesség
iw: מהירות
ro: Viteză

# baseSpeed
source: Slow
hu: Lassú
iw: איטי
ro: Lent

# proSpeed
source: Hyper fast
hu: Villámgyors
iw: מהיר מאוד
ro: Foarte rapid

source: Reliability
hu: Megbízhatóság
iw: אמינות
ro: Fiabilitate

# baseReliability
source: Sometimes won't answer or get error
hu: Néha nem válaszol vagy hibát ad
iw: לפעמים לא עונה או יש שגיאה
ro: Uneori nu răspunde sau dă eroare

# proReliability
source: Never gets error and always answer
hu: Soha nem hibázik és mindig válaszol
iw: אף פעם לא שוגה ותמיד עונה
ro: Nu dă niciodată eroare și răspunde mereu

source: Intelligence
hu: Intelligencia
iw: אינטליגנציה
ro: Inteligență

# baseIntelligence
source: Smart, but not as much as ChatGPT
hu: Okos, de nem annyira mint a ChatGPT
iw: חכם, אבל לא כמו ChatGPT
ro: Deștept, dar nu la fel de mult ca ChatGPT

# proIntelligence
source: ChatGPT level intelligence
hu: ChatGPT szintű intelligencia
iw: אינטליגנציה ברמת ChatGPT
ro: Inteligență la nivel ChatGPT

source: Ads
hu: Reklámok
iw: פרסומות
ro: Reclame

# baseAds
source: Has ads
hu: Vannak reklámok
iw: יש פרסומות
ro: Are reclame

# proAds
source: No ads
hu: Nincsenek reklámok
iw: אין פרסומות
ro: Fără reclame

source: Base
hu: Alap
iw: בסיסי
ro: De bază

source: Modes
hu: Módok
iw: מצבים
ro: Moduri

source: Select AI Mode:
hu: AI mód kiválasztása:
iw: בחר מצב AI:
ro: Selectează modul AI:

# modeDefault
source: Default
hu: Alapértelmezett
iw: ברירת מחדל
ro: Implicit

# modeDefaultDesc
source: Original AnonAI personality
hu: Eredeti AnonAI személyiség
iw: אישיות AnonAI המקורית
ro: Personalitatea originală AnonAI

# modeDirect
source: Direct
hu: Közvetlen
iw: ישיר

# modeDirectDesc
source: Clear, direct and actionable responses
hu: Világos, közvetlen és gyakorlatias válaszok
iw: תשובות ברורות, ישירות וניתנות לפעולה
ro: Răspunsuri clare, directe și acționabile

# modeAngry
source: Angry
hu: Dühös
iw: כועס
ro: Supărat

# modeAngryDesc
source: Passionate and intense responses
hu: Szenvedélyes és intenzív válaszok
iw: תשובות נלהבות ואינטנסיביות
ro: Răspunsuri pasionale și intense

# modeChill
source: Chill
hu: Laza
iw: רגוע
ro: Relaxat

# modeChillDesc
source: Relaxed and casual conversations
hu: Nyugodt és könnyed beszélgetések
iw: שיחות רגועות וקלילות
ro: Conversații relaxate și casual

# modeTikTok
source: TikTok Commenter
hu: TikTok Kommentelő
iw: מגיב TikTok
ro: Comentator TikTok

# modeTikTokDesc
source: Chaotic TikTok comment section energy
hu: Kaotikus TikTok komment szekció energia
iw: אנרגיה כאוטית של תגובות TikTok
ro: Energia haotică a secțiunii de comentarii TikTok

# modeNerd
source: Nerd
hu: Stréber
iw: חנון
ro: Tocilarul

# modeNerdDesc
source: Technical and detailed explanations
hu: Technikai és részletes magyarázatok
iw: הסברים טכניים ומפורטים
ro: Explicații tehnice și detaliate

# modeProfessional
source: Professional
hu: Professzionális
iw: מקצועי
ro: Profesional

# modeProfessionalDesc
source: Formal and business-like tone
hu: Formális és üzleti hangnem
iw: טון פורמלי ועסקי
ro: Ton formal și de afaceri

# modeTeacher
source: Teacher
hu: Tanár
iw: מורה
ro: Profesor

# modeTeacherDesc
source: Educational and explanatory responses
hu: Oktatási és magyarázó válaszok
iw: תשובות חינוכיות ומסבירות
ro: Răspunsuri educaționale și explicative

# modeUnhinged
source: Unhinged
hu: Elmebeteg
iw: משוחרר
ro: Dezlănțuit

# modeUnhingedDesc
source: Completely unhinged and boundary-free responses
hu: Teljesen elszabadult és határokat nem ismerő válaszok
iw: תשובות משוחררות וללא גבולות
ro: Răspunsuri complet dezlănțuite și fără limite

source: Style
hu: Stílus
iw: סגנון
ro: Stil

source: Not signed in
hu: Nincs bejelentkezve
iw: לא מחובר
ro: Nu ești conectat

# signInToSync
source: Sign in to sync your data
hu: Jelentkezz be az adatok szinkronizálásához
iw: התחבר כדי לסנכרן את הנתונים שלך
ro: Conectează-te pentru a sincroniza datele

source: Monthly
hu: Havi
iw: חודשי
ro: Lunar

source: Billed monthly
hu: Havonta számlázva
iw: מחויב חודשי
ro: Facturat lunar

source: Yearly
hu: Éves
iw: שנתי
ro: Anual

source: Billed annually
hu: Évente számlázva
iw: מחויב שנתי
ro: Facturat anual

source: Save 31.5%
hu: 31,5% megtakarítás
iw: חסוך 31.5%
ro: Economisește 31,5%

# chooseSubscriptionPlan
source: Choose your subscription plan
hu: Válaszd ki az előfizetési terved
iw: בחר את תוכנית המנוי שלך
ro: Alege planul de abonament

source: Bubble Roundness
hu: Buborék lekerekítés
iw: עיגול בועות
ro: Rotunjirea bulelor

# bubbleRoundnessDesc
source: Adjust the roundness of message bubbles
hu: Üzenet buborékok lekerekítésének beállítása
iw: התאם את עיגול בועות ההודעות
ro: Ajustează rotunjirea bulelor de mesaj

source: Corner Smoothing
hu: Sarok simítás
iw: החלקת פינות
ro: Netezirea colțurilor

# cornerSmoothingDesc
source: Adjust the smoothness of bubble corners
hu: Buborék sarkok simításának beállítása
iw: התאם את החלקת פינות הבועות
ro: Ajustează netezirea colțurilor bulelor

# setupWelcomeTitle
source: Welcome to AnonAI
hu: Üdvözöl az AnonAI
iw: ברוך הבא ל-AnonAI
ro: Bun venit la AnonAI

# setupWelcomeSubtitle
source: Let's set up your AI assistant to match your preferences
hu: Állítsuk be az AI asszisztenst a preferenciáid szerint
iw: בוא נגדיר את עוזר ה-AI שלך לפי ההעדפות שלך
ro: Să configurăm asistentul tău AI să se potrivească preferințelor tale

# setupMultipleLanguages
source: Multiple languages
hu: Több nyelv
iw: שפות מרובות
ro: Limbi multiple

# setupCustomizableThemes
source: Customizable themes
hu: Testreszabható témák
iw: ערכות נושא ניתנות להתאמה
ro: Teme personalizabile

# setupPersonalizedExperience
source: Personalized experience
hu: Személyre szabott élmény
iw: חווייה מותאמת אישית
ro: Experiență personalizată

# setupPrivacyFocused
source: Privacy focused
hu: Adatvédelem-központú
iw: ממוקד פרטיות
ro: Orientat spre confidențialitate

# setupChooseLanguage
source: Choose Your Language
hu: Válaszd ki a nyelvet
iw: בחר את השפה שלך
ro: Alege limba ta

# setupChooseLanguageDesc
source: Select your preferred language for the app
hu: Válaszd ki az alkalmazás preferált nyelvét
iw: בחר את השפה המועדפת לאפליקציה
ro: Selectează limba preferată pentru aplicație

# setupChooseTheme
source: Choose Your Theme
hu: Válaszd ki a témát
iw: בחר את ערכת הנושא שלך
ro: Alege tema ta

# setupChooseThemeDesc
source: Select the appearance that suits you best
hu: Válaszd ki a neked megfelelő megjelenést
iw: בחר את המראה שהכי מתאים לך
ro: Selectează aspectul care ți se potrivește cel mai bine

# setupDarkTheme
source: Dark Theme
hu: Sötét téma
iw: ערכת נושא כהה
ro: Tema întunecată

# setupDarkThemeDesc
source: Easy on the eyes, perfect for night use
hu: Kíméletes a szemnek, tökéletes éjszakai használatra
iw: נוח לעיניים, מושלם לשימוש בלילה
ro: Ușor pentru ochi, perfect pentru folosirea nocturnă

# setupLightTheme
source: Light Theme
hu: Világos téma
iw: ערכת נושא בהירה
ro: Tema luminoasă

# setupLightThemeDesc
source: Clean and bright, great for daytime
hu: Tiszta és világos, nagyszerű nappali használatra
iw: נקי ובהיר, נהדר לשימוש ביום
ro: Curată și luminoasă, excelentă pentru zi

# setupCustomizeExperience
source: Customize Your Experience
hu: Szabd testre az élményt
iw: התאם אישית את החוויה שלך
ro: Personalizează experiența ta

# setupCustomizeExperienceDesc
source: Adjust these settings to make the app feel just right
hu: Állítsd be ezeket a beállításokat, hogy az alkalmazás tökéletes legyen
iw: התאם את ההגדרות כדי שהאפליקציה תרגיש בדיוק כמו שצריך
ro: Ajustează aceste setări pentru a face aplicația să se simtă perfect

# setupAccountSetup
source: Account Setup
hu: Fiók beállítása
iw: הגדרת חשבון
ro: Configurarea contului

# setupAccountSetupDesc
source: Sign in to sync your preferences across devices
hu: Jelentkezz be a beállítások szinkronizálásához az eszközök között
iw: התחבר כדי לסנכרן העדפות בין מכשירים
ro: Conectează-te pentru a sincroniza preferințele pe toate dispozitivele

# setupSignIn
source: Sign In
hu: Bejelentkezés
iw: התחבר
ro: Conectare

# setupSkipForNow
source: Skip for now
hu: Kihagyás egyelőre
iw: דלג לעת עתה
ro: Sari pentru moment

# setupBenefitsTitle
source: Benefits of signing in:
hu: A bejelentkezés előnyei:
iw: היתרונות של התחברות:
ro: Beneficiile conectării:

# setupSyncAcrossDevices
source: Sync across devices
hu: Szinkronizálás eszközök között
iw: סנכרון בין מכשירים
ro: Sincronizare pe dispozitive

# setupBackupData
source: Backup your data
hu: Adatok mentése
iw: גבה את הנתונים שלך
ro: Faceți backup datelor

# setupAccessPremium
source: Access premium features
hu: Prémium funkciókhoz hozzáférés
iw: גישה לתכונות פרימיום
ro: Accesați funcții premium

# setupAllSet
source: All Set!
hu: Minden kész!
iw: הכל מוכן!
ro: Totul gata!

# setupAllSetDesc
source: Your AnonAI assistant is ready to help you. Enjoy your personalized experience!
hu: Az AnonAI asszisztensed készen áll, hogy segítsen. Élvezd a személyre szabott élményt!
iw: העוזר שלך מוכן לעזור. תהנה מחוויה מותאמת אישית!
ro: Asistentul tău AnonAI este gata să te ajute. Bucură-te de experiența ta personalizată!

# setupYourSetup
source: Your Setup:
hu: A beállításaid:
iw: ההגדרות שלך:
ro: Configurația ta:

# setupLanguageLabel
source: Language
hu: Nyelv
iw: שפה
ro: Limba

# setupThemeLabel
source: Theme
hu: Téma
iw: ערכת נושא
ro: Tema

# setupFontSizeLabel
source: Font Size
hu: Betűméret
iw: גודל גופן
ro: Mărimea fontului

# setupAccountLabel
source: Account
hu: Fiók
iw: חשבון
ro: Contul

# setupNotSignedIn
source: Not signed in
hu: Nincs bejelentkezve
iw: לא מחובר
ro: Nu ești conectat

# setupSignedIn
source: Signed in
hu: Bejelentkezve
iw: מחובר
ro: Conectat

# setupEnterAnonAI
source: Enter AnonAI
hu: Belépés az AnonAI-ba
iw: היכנס ל-AnonAI
ro: Intră în AnonAI

# setupGetStarted
source: Get Started
hu: Kezdjük el
iw: התחל
ro: Începe

# setupContinue
source: Continue
hu: Folytatás
iw: המשך
ro: Continuă

# setupBack
source: Back
hu: Vissza
iw: חזור
ro: Înapoi

# setupDark
source: Dark
hu: Sötét
iw: כהה
ro: Întunecat

# setupLight
source: Light
hu: Világos
iw: בהיר
ro: Luminos

# unhingedWarningTitle
source: Warning
hu: Figyelmeztetés
iw: אזהרה
ro: Avertisment

# unhingedWarningMessage
source: The unhinged mode works MUCH more freely and uninhibitedly with AnonAI Pro.
hu: Az elmebeteg mód SOKKAL szabadabban és elengedettebben működik az AnonAI Pro-val.
iw: המצב המשוחרר עובד הרבה יותר בחופשיות וללא מעצורים עם AnonAI Pro.
ro: Modul dezlănțuit funcționează MULT mai liber și mai dezinhibat cu AnonAI Pro.

# uploadImageWarningTitle
source: Developer Feature
hu: Fejlesztői Funkció
iw: פונקציית מפתחים
ro: Funcție pentru dezvoltatori

# uploadImageWarningMessage
source: This feature is exclusively available for developers, as it's not 100% functional yet.
hu: Ez a funkció kizárólag fejlesztőknek elérhető, mert még nem 100%-osan működik.
iw: פונקציה זו זמינה למפתחים בלבד, כיוון שהיא עדיין לא פועלת במלואה.
ro: Această funcție este disponibilă exclusiv dezvoltatorilor, deoarece nu este încă complet funcțională.

source: Okay
hu: Oké
iw: אישור
ro: Ok

source: Upload Image
hu: Kép feltöltése
iw: העלה תמונה
ro: Încarcă imagine

source: Tools
hu: Eszközök
iw: כלים
ro: Unelte

# writingStyleTitle
source: Writing Style
hu: Írásstílus
iw: סגנון כתיבה
ro: Stil de scriere

# writingStyleDescription
source: The AI rewrites your message in a different style.
hu: Az AI átírja az üzeneted más stílusban.
iw: ה-AI משכתב את ההודעה שלך בסגנון אחר.
ro: AI-ul rescrie mesajul tău într-un alt stil.

# grammarCheckTitle
source: Grammar Check
hu: Nyelvtani ellenőrzés
iw: בדיקת דקדוק
ro: Verificare gramaticală

# grammarCheckDescription
source: Fix grammar and spelling in your text.
hu: Javítja a szöveg helyesírását és nyelvtanát.
iw: מתקן דקדוק ואיות בטקסט.
ro: Corectează gramatica și ortografia textului.

# grammarCheckTab
source: Grammar
hu: Nyelvtan
iw: דקדוק
ro: Gramatică

# grammarCheckLoading
source: Checking grammar...
hu: Nyelvtan ellenőrzése folyamatban...
iw: בודק דקדוק...
ro: Se verifică gramatica...

# passwordDialogTitle
source: Access Required
hu: Hozzáférés szükséges

# passwordDialogMessage
source: Enter the password to access Writing Style tools
hu: Add meg a jelszót a Writing Style eszközök eléréséhez

# passwordInputHint
source: Enter password
hu: Jelszó megadása

source: Incorrect password
hu: Helytelen jelszó

source: Unlock
hu: Feloldás
